app/Http/Controllers/FasilitasController.php

    public function index(About $about)
    {
        return view('fasilitas.index', [
            'title' => 'Fasilitas Unggulan',
            'name' => $about->nama_instansi,
            'about' => About::all(),
            'pelayanan' => Pelayanan::all(),
            'facilities' => Fasilitas::all()
        ]);
---
SELECT * FROM `fasilitas` WHERE `unggulan` = 1
SELECT * FROM `abouts`
SELECT * FROM `pelayanans`

    public function show(Fasilitas $fasilitas)
    {
        return view('fasilitas.show', [
            'title' => $fasilitas->name,
            'name' => 'RSIA Livasya',
            'fasilitas' => $fasilitas,
            'about' => About::all(),
            'pelayanan' => Pelayanan::all()
        ]);
---
SELECT * FROM `pelayanans`
SELECT * FROM `abouts`